#### Terraform Plan 📝 for `staging/apps/portfolio`
<details><summary>Show Plan</summary>

```

module.static_portfolio.module.r53.data.aws_route53_zone.jordibru_cloud: Reading...
module.static_portfolio.module.acm.data.aws_route53_zone.jordibru_cloud: Reading...
module.static_portfolio.module.r53.data.aws_route53_zone.jordibru_cloud: Read complete after 0s [id=Z0416635OCIECZEMO3JV]
module.static_portfolio.module.acm.data.aws_route53_zone.jordibru_cloud: Read complete after 0s [id=Z0416635OCIECZEMO3JV]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.static_portfolio.module.acm.aws_acm_certificate.domain_certificate will be created
  + resource "aws_acm_certificate" "domain_certificate" {
      + arn                       = (known after apply)
      + domain_name               = "staging-portfolio.jordibru.cloud"
      + domain_validation_options = [
          + {
              + domain_name           = "staging-portfolio.jordibru.cloud"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "staging-portfolio.jordibru.cloud",
        ]
      + tags                      = {
          + "owner"     = "jordi"
          + "stage"     = "staging"
          + "terraform" = "true"
        }
      + tags_all                  = {
          + "owner"     = "jordi"
          + "stage"     = "staging"
          + "terraform" = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.static_portfolio.module.acm.aws_acm_certificate_validation.validations will be created
  + resource "aws_acm_certificate_validation" "validations" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.static_portfolio.module.acm.aws_route53_record.cert_validations["staging-portfolio.jordibru.cloud"] will be created
  + resource "aws_route53_record" "cert_validations" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0416635OCIECZEMO3JV"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @JordiiBru, Action: pull_request in Path: `staging/apps/portfolio`*